tome9111991/ESP32-S3_Project/ESP32-8048S043C/KlipperCryptoWeatherPanel/KlipperCryptoWeatherPanel.ino
// --- KONFIGURATION ---
#if __has_include("config_private.h")
  #include "config_private.h"
#endif
#ifndef WIFI_SSID
  #define WIFI_SSID ""
#endif
#ifndef WIFI_PASSWORD
  #define WIFI_PASSWORD ""
#endif
#ifndef LOCATION_LATITUDE
  #error "LOCATION_LATITUDE fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Daten ein."
#endif
#ifndef LOCATION_LONGITUDE
  #error "LOCATION_LONGITUDE fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Daten ein."
#endif
#ifndef TIMEZONE_POSIX
  #error "TIMEZONE_POSIX fehlt. Kopiere config_private.example.h nach config_private.h und trage deine Zeitzone ein."
#endif
#ifndef CRYPTO_BASE_SYMBOL
  #define CRYPTO_BASE_SYMBOL "BTC"
#endif
#ifndef CRYPTO_QUOTE_SYMBOL
  #define CRYPTO_QUOTE_SYMBOL "USD"
#endif
#ifndef CRYPTO_PRICE_PREFIX
  #define CRYPTO_PRICE_PREFIX ""
#endif
#ifndef CRYPTO_SERVICE_NAME
  #define CRYPTO_SERVICE_NAME "COINBASE"
#endif
#ifndef CRYPTO_CHART_TIMEFRAME
  #define CRYPTO_CHART_TIMEFRAME "1D"
#endif
#ifndef KLIPPER_BASE_URL
  #define KLIPPER_BASE_URL "http://mainsail"
#endif

String wifiSsid = String(WIFI_SSID);
String wifiPassword = String(WIFI_PASSWORD);

// Bright Sky liefert DWD-Daten ohne API-Key.
const float locationLatitude = LOCATION_LATITUDE;
const float locationLongitude = LOCATION_LONGITUDE;
const char* timezonePosix = TIMEZONE_POSIX;
// Coinbase Crypto-Paar. Fuer SOL/EUR z.B. cryptoBaseSymbol="SOL", cryptoQuoteSymbol="EUR".
static constexpr size_t CRYPTO_SYMBOL_MAX_LEN = 12;
static constexpr size_t CRYPTO_PREFIX_MAX_LEN = 12;
static constexpr size_t CRYPTO_SERVICE_MAX_LEN = 16;
static constexpr size_t CRYPTO_TIMEFRAME_MAX_LEN = 8;
char cryptoBaseSymbol[CRYPTO_SYMBOL_MAX_LEN + 1] = CRYPTO_BASE_SYMBOL;
char cryptoQuoteSymbol[CRYPTO_SYMBOL_MAX_LEN + 1] = CRYPTO_QUOTE_SYMBOL;
char cryptoPricePrefix[CRYPTO_PREFIX_MAX_LEN + 1] = CRYPTO_PRICE_PREFIX; // leer = automatisch: USD/EUR/GBP/JPY/BTC Symbol, sonst Quote-Code
char cryptoServiceName[CRYPTO_SERVICE_MAX_LEN + 1] = CRYPTO_SERVICE_NAME;
char cryptoChartTimeframe[CRYPTO_TIMEFRAME_MAX_LEN + 1] = CRYPTO_CHART_TIMEFRAME;
const char* klipperBaseUrl = KLIPPER_BASE_URL;
const unsigned long btcRefreshInterval = 60000; // 60 Sekunden
const unsigned long btcRetryInterval = 30000; // 30 Sekunden bei Fehlern
const unsigned long btcCandleRefreshInterval = 300000; // 5 Minuten
const unsigned long btcCandleRetryInterval = 60000; // 60 Sekunden bei Fehlern
const unsigned long btcStatsRefreshInterval = 300000; // 5 Minuten (24h-Open)
const unsigned long btcStatsRetryInterval = 60000; // 60 Sekunden bei Fehlern
const unsigned long weatherRefreshInterval = 300000; // 5 Minuten
const unsigned long weatherRetryInterval = 120000; // 2 Minuten bei Fehlern
const unsigned long klipperRefreshInterval = 7000; // 7 Sekunden
const unsigned long klipperRetryInterval = 30000; // 30 Sekunden bei Fehlern
const unsigned long klipperNameRefreshInterval = 300000; // 5 Minuten
const unsigned long klipperNameRetryInterval = 120000; // 2 Minuten bei Fehlern
const uint32_t BTC_CANDLE_SECONDS = 86400; // Tageskerzen
const int WEATHER_ICON_W = 93;
const int WEATHER_ICON_H = 80;
const int DIVIDER_H = 4;
const int PROMINENT_DIVIDER_H = 5;
const int TIME_SECOND_BAR_W = 440;
const int TIME_SECOND_BAR_X = (UI_LOGICAL_W - TIME_SECOND_BAR_W) / 2;
const int CRYPTO_PRICE_BAR_W = 460;
const int CRYPTO_PRICE_BAR_X = (UI_LOGICAL_W - CRYPTO_PRICE_BAR_W) / 2;
const int MMU_GATE_MAX = 8;

// --- GLOBALE VARIABLEN (Thread-Safe) ---
SemaphoreHandle_t dataMutex;
SemaphoreHandle_t networkMutex;
TaskHandle_t fetchTaskHandle = NULL;
bool fetchTaskStackInPsram = false;
bool settingsStorageReady = false;
String currentBtcPrice = "Laden...";
float currentBtcLivePrice = 0.0f;
int currentBtcPriceDirection = 0;
String currentBtcStatus = String(cryptoServiceName) + " " + cryptoQuoteSymbol;
String btcDayChange = "1D --";
String btcDayTimeRange = "--";
String btcDayVolume = "VOL --";
String btcCandleStatus = "CANDLE --";
String currentTemp = "--";
String weatherStatus = "WETTER: --";
String weatherLocation = "DWD Station";
int weatherCode = -1;
bool klipperAvailable = false;
bool klipperHostAvailable = false;
String klipperConnectionState = "--";
String klipperConnectionMessage = "";
String klipperState = "--";
String klipperFile = "Kein Job";
String klipperProgress = "--";
String klipperNozzle = "--";
String klipperBed = "--";
String klipperDuration = "--";
String klipperStatus = "KLIPPER --";
String klipperDisplayMessage = "";
String klipperPrinterName = "KLIPPER";
String klipperMetadataFilename = "";
float klipperEstimatedDurationSeconds = 0.0f;
unsigned long klipperMetadataRetryAfter = 0;
bool klipperMmuAvailable = false;
String klipperMmuInfo = "MMU --";
int klipperMmuTool = -1;
int klipperMmuGate = -1;
int klipperMmuGateCount = 0;
uint32_t klipperMmuGateColors[MMU_GATE_MAX] = {
  COLOR_DIM, COLOR_DIM, COLOR_DIM, COLOR_DIM,
  COLOR_DIM, COLOR_DIM, COLOR_DIM, COLOR_DIM
};
int klipperMmuGateStatus[MMU_GATE_MAX] = {
  -1, -1, -1, -1, -1, -1, -1, -1
};
volatile bool wifiConnected = false;
volatile bool cleanRebootRequested = false;
volatile bool cryptoRefreshRequested = false;
bool wifiSetupActive = false;
bool settingsMenuActive = false;
bool timeConfigured = false;
volatile unsigned long wifiConnectedSince = 0;
bool internetAvailable = false;
unsigned long lastInternetProbe = 0;
unsigned long lastWifiReconnectAttempt = 0;
const unsigned long wifiReconnectInterval = 10000;
const unsigned long wifiConnectAttemptTimeout = 30000;
const unsigned long wifiStableBeforeFetchInterval = 8000;
const unsigned long apiRequestGapInterval = 1500;
const unsigned long internetProbeRetryInterval = 30000;
unsigned long lastHealthLog = 0;
const unsigned long healthLogInterval = 60000;
const uint32_t fetchTaskStackSize = 16384;
const UBaseType_t fetchTaskPriority = 1;
// Auf diesem Setup nicht auf Core 0 legen: dort laufen WLAN/TCPIP-Anteile und IDLE0-WDT.
const BaseType_t fetchTaskCore = 1;

struct BtcCandle {
  uint32_t time;
  float low;
  float high;
  float open;
  float close;
  float volume;
};

