tome9111991/ESP32-S3_Project/ESP32-8048S043C/KlipperCryptoWeatherPanel/KlipperCryptoWeatherPanel.ino
const int BTC_CANDLE_CAPACITY = 300;
const int BTC_DAY_CANDLE_COUNT = 90; // 90 Tageskerzen
const int BTC_CHART_W = 720;
const int BTC_CHART_H = 250;
const int BTC_CHART_CANVAS_H = 264;
const int BTC_CHART_PROGRESS_Y = 258;
const int BTC_CHART_PROGRESS_H = 5;
BtcCandle* btcCandles = nullptr;
BtcCandle* parsedBtcCandles = nullptr;
BtcCandle* chartBtcCandles = nullptr;
bool btcCandleStorageInPsram = false;
bool parsedBtcCandleStorageInPsram = false;
bool chartBtcCandleStorageInPsram = false;
int btcCandleCount = 0;
float btcDayChangePercent = 0.0f;
bool btcDayChangePositive = true;
bool btcDayDataReady = false;
float btc24hOpenPrice = 0.0f;
bool btc24hDataReady = false;
unsigned long lastBtcChartDraw = 0;
const unsigned long btcChartDrawInterval = 1000;

// UI State Machine
enum ScreenState { SCREEN_TIME, SCREEN_CRYPTO, SCREEN_BTC_DAY, SCREEN_KLIPPER };
enum WeatherVisual {
  WEATHER_VISUAL_UNKNOWN,
  WEATHER_VISUAL_CLEAR,
  WEATHER_VISUAL_PARTLY,
  WEATHER_VISUAL_CLOUD,
  WEATHER_VISUAL_RAIN,
  WEATHER_VISUAL_SNOW,
  WEATHER_VISUAL_FOG,
  WEATHER_VISUAL_THUNDER
};
enum SunStatusVisual {
  SUN_STATUS_VISUAL_UNKNOWN,
  SUN_STATUS_VISUAL_SUNRISE,
  SUN_STATUS_VISUAL_DAY,
  SUN_STATUS_VISUAL_SUNSET,
  SUN_STATUS_VISUAL_NIGHT
};

ScreenState currentScreen = SCREEN_TIME;
bool screenTimeEnabled = true;
bool screenCryptoEnabled = true;
bool screenBtcDayEnabled = true;
bool screenKlipperEnabled = true;
unsigned long lastScreenSwitch = 0;
unsigned long lastUiRefresh = 0;
const unsigned long defaultScreenInterval = 10000; // 10 Sekunden fuer alle normalen Screens
const unsigned long timeScreenInterval = 25000;    // Uhrzeit-Screen 25 Sekunden anzeigen
const unsigned long uiRefreshInterval = 500;
const unsigned long screenTransitionDuration = 180;
const unsigned long screenSwitchSettleInterval = 450; // Chart erst nach Screenwechsel/Animation neu zeichnen
const unsigned long brightnessRefreshInterval = 30000;
const unsigned long touchPollInterval = 20;
const unsigned long touchReleaseInterval = 120;
const unsigned long touchLongPressInterval = 3000;
const unsigned long touchLongPressFeedbackDelay = 180;
static constexpr uint8_t DAY_BRIGHTNESS_MIN = 32;
static constexpr uint8_t DAY_BRIGHTNESS_MAX = 255;
static constexpr uint8_t DAY_BRIGHTNESS_DEFAULT = 176;
uint8_t dayBrightness = DAY_BRIGHTNESS_DEFAULT;
const uint8_t nightBrightness = 12;
const int sunriseBrightnessDelayMinutes = 90; // Display morgens erst 90 Minuten nach Sonnenaufgang hell schalten
uint8_t currentBrightness = dayBrightness;
unsigned long lastBrightnessRefresh = 0;

static constexpr int TOUCH_SDA = 19;
static constexpr int TOUCH_SCL = 20;
static constexpr int TOUCH_RST = 38;
static constexpr int TOUCH_INT = 18;
static constexpr uint16_t GT911_STATUS_REG = 0x814E;
static constexpr uint16_t GT911_POINT_REG = 0x814F;
static constexpr uint16_t GT911_PRODUCT_ID_REG = 0x8140;
// Standardwerte; werden ggf. durch Werte aus /touch_cal.json ueberschrieben.
static float TOUCH_CAL_X_RX = 1.65867031f;
static float TOUCH_CAL_X_RY = -0.02261823f;
static float TOUCH_CAL_X_C = 2.12817001f;
static float TOUCH_CAL_Y_RX = 0.02082564f;
static float TOUCH_CAL_Y_RY = 1.79517055f;
static float TOUCH_CAL_Y_C = 10.62223816f;
static uint8_t touchAddress = 0;
static bool touchPressed = false;
static bool touchLongPressHandled = false;
static int16_t touchStartX = 0;
static int16_t touchStartY = 0;
static int16_t touchLastX = 0;
static int16_t touchLastY = 0;
static unsigned long touchPressedAt = 0;
static unsigned long touchLastSeenAt = 0;
static unsigned long lastTouchPoll = 0;
static lv_obj_t* touchLongPressFeedbackRoot = nullptr;
static lv_obj_t* touchLongPressFeedbackArc = nullptr;
static int touchLongPressFeedbackValue = -1;

static lv_obj_t* bootScreen = nullptr;
static lv_obj_t* timeScreen = nullptr;
static lv_obj_t* cryptoScreen = nullptr;
static lv_obj_t* btcDayScreen = nullptr;
static lv_obj_t* klipperScreen = nullptr;
static lv_obj_t* timeAccent = nullptr;
static lv_obj_t* timeLocationLabel = nullptr;
static lv_obj_t* timeLabel = nullptr;
static lv_obj_t* weekdayLabel = nullptr;
static lv_obj_t* dateLabel = nullptr;
static lv_obj_t* tempLabel = nullptr;
static lv_obj_t* weatherIconRoot = nullptr;
static lv_obj_t* timeDivider = nullptr;
static lv_obj_t* timeSecondFill = nullptr;
static lv_obj_t* timeStatusTitle = nullptr;
static lv_obj_t* timeStatusDetail = nullptr;
static lv_obj_t* cryptoPriceLabel = nullptr;
static lv_obj_t* cryptoTitleLabel = nullptr;
static lv_obj_t* cryptoStatusLabel = nullptr;
static lv_obj_t* cryptoChangeLabel = nullptr;
static lv_obj_t* btcDayTitleLabel = nullptr;
static lv_obj_t* btcDayPriceLabel = nullptr;
static lv_obj_t* btcDayChangeLabel = nullptr;
static lv_obj_t* btcDayTimeRangeLabel = nullptr;
static lv_obj_t* btcDayVolumeLabel = nullptr;
static lv_obj_t* btcDayCandleLabel = nullptr;
static lv_obj_t* btcDayChartCanvas = nullptr;
static lv_obj_t* btcDayPriceHighLabel = nullptr;
static lv_obj_t* btcDayPriceLowLabel = nullptr;
static lv_obj_t* btcDayPriceLastLabel = nullptr;
static lv_obj_t* klipperAccent = nullptr;
static lv_obj_t* klipperDivider = nullptr;
static lv_obj_t* klipperOfflineRing = nullptr;
static lv_obj_t* klipperOfflineStem = nullptr;
static lv_obj_t* klipperOfflineLine = nullptr;
static lv_obj_t* klipperOfflineIcon = nullptr;
static lv_obj_t* klipperTitleLabel = nullptr;
static lv_obj_t* klipperStateLabel = nullptr;
static lv_obj_t* klipperFileLabel = nullptr;
static lv_obj_t* klipperProgressLabel = nullptr;
static lv_obj_t* klipperProgressArc = nullptr;
static lv_obj_t* klipperNozzleTitleLabel = nullptr;
static lv_obj_t* klipperNozzleLabel = nullptr;
static lv_obj_t* klipperBedTitleLabel = nullptr;
static lv_obj_t* klipperBedLabel = nullptr;
static lv_obj_t* klipperDurationLabel = nullptr;
static lv_obj_t* klipperStatusLabel = nullptr;
static lv_obj_t* klipperMmuLabel = nullptr;
static lv_obj_t* klipperMmuGateBox[MMU_GATE_MAX] = {};
static lv_obj_t* klipperMmuGateLabel[MMU_GATE_MAX] = {};
static lv_obj_t* klipperMmuGateEmptyLine[MMU_GATE_MAX] = {};
static lv_point_precise_t klipperMmuGateEmptyPts[MMU_GATE_MAX][2] = {};
static uint8_t* btcDayChartCanvasBuf = nullptr;
static bool btcDayChartCanvasBufInPsram = false;
static lv_obj_t* weatherImage = nullptr;
static WeatherVisual lastWeatherVisual = WEATHER_VISUAL_UNKNOWN;
static bool weatherImageDrawn = false;
static int lastTimeSecondProgress = -1;

struct SunStatusIcon {
  lv_obj_t* root;
  SunStatusVisual lastVisual;
};

static SunStatusIcon timeSunIcon = {};

// --- Funktions-Prototypen fuer ausgelagerte Arduino-Tabs ---
void yieldFetchTask();
static uint32_t lvTickMillis();
const char* resetReasonName(esp_reset_reason_t reason);
void printBootDiagnostics();
void printDisplayDiagnostics();
void printRuntimeHealth();
bool getLocalTimeFast(struct tm& timeinfo);
bool configureTimeOnce();
void lvFlush(lv_display_t* disp, const lv_area_t* area, uint8_t* pxMap);
void setDisplayBrightness(uint8_t brightness);
int clampMinuteOfDay(int minute);
int localUtcOffsetMinutes(const struct tm& timeinfo);
bool calculateSunTimes(const struct tm& timeinfo, int& sunriseMinute, int& sunsetMinute);
int calculateSunStrength(const struct tm& timeinfo, int sunriseMinute, int sunsetMinute);
void updateBrightnessBySun();
lv_obj_t* createScreen();
lv_obj_t* createLabel(lv_obj_t* parent, const lv_font_t* font, uint32_t color, lv_text_align_t align);
lv_obj_t* createAccent(lv_obj_t* parent, uint32_t color);
lv_obj_t* createDivider(lv_obj_t* parent, int x, int y, int w, uint32_t color);
lv_obj_t* createDividerSized(lv_obj_t* parent, int x, int y, int w, int h, uint32_t color);
void updateTimeSecondProgress(int second);
void setHidden(lv_obj_t* obj, bool hidden);
bool setLabelTextIfChanged(lv_obj_t* label, const char* text);
void setTimeNormalVisible(bool visible);
void styleFilledRect(lv_obj_t* obj, uint32_t color, int radius);
lv_obj_t* createSunRay(lv_obj_t* parent, int x, int y, int w, int h);
WeatherVisual weatherVisualFromCode(int code);
const lv_image_dsc_t* weatherImageForVisual(WeatherVisual visual);
int weatherVisualLeftInset(WeatherVisual visual);
int timeTextPixelWidth(const char* text);
void placeWeatherImage(const char* timeText);
lv_obj_t* createWeatherImage(lv_obj_t* parent);
void updateWeatherImage(int code);
void updateWeatherImagePositionForTime(const char* timeText);
SunStatusIcon createSunStatusIcon(lv_obj_t* parent);
const lv_image_dsc_t* sunStatusImageForVisual(SunStatusVisual visual);
SunStatusVisual sunStatusVisualFromTime(int nowMinute, int sunriseMinute, int sunsetMinute);
void updateSunStatusIcon(SunStatusIcon& icon, SunStatusVisual visual);
void updateSunStatusIcon(const struct tm& timeinfo);
void createTimeScreen();
void createCryptoScreen();
void createBtcDayScreen();
void createKlipperScreen();
void createBootScreen();
void createUi();
bool initSettingsStorage();
bool loadWifiSettingsFromFile();
bool saveWifiSettingsToFile(const String& ssidValue, const String& passwordValue);
bool wifiCredentialsConfigured();
bool isWifiSetupScreenActive();
void openWifiSetupScreen(const char* message);
bool isSettingsMenuScreenActive();
bool isSettingsOverlayActive();
void openSettingsMenuScreen();
bool isScreenSettingsScreenActive();
void openScreenSettingsScreen();
bool loadScreenSettingsFromFile();
bool saveScreenSettingsToFile();
bool isCryptoSettingsScreenActive();
void openCryptoSettingsScreen();
bool loadCryptoSettingsFromFile();
bool saveCryptoSettingsToFile();
bool isDisplaySettingsScreenActive();
void openDisplaySettingsScreen();
bool loadDisplaySettingsFromFile();
bool saveDisplaySettingsToFile();
void performCleanReboot();
void performFactoryReset();
void startNetworkServices();
bool startFetchTask();
void refreshTimeUi();
void refreshCryptoUi();
String formatBtcCandleCountdown(uint32_t candleTime);
void refreshBtcDayUi();
int progressPercentFromText(const String& progress);
void refreshKlipperUi();
void refreshUi();
bool isKlipperScreenAvailable();
bool isScreenEnabled(ScreenState state);
bool isScreenAvailableForRotation(ScreenState state);
lv_obj_t* screenForState(ScreenState state);
ScreenState nextScreenState(ScreenState state);
ScreenState previousScreenState(ScreenState state);
void switchScreen(ScreenState nextScreen);
void switchScreenFromTouch(ScreenState nextScreen);
bool initTouchInput();
void initLvglTouchInput();
void handleTouchInput();
void onTouchLongPress(int16_t x, int16_t y);
bool isPopupMenuOpen();
void openPopupMenu();
void closePopupMenu();
void handlePopupMenuTouch(int16_t x, int16_t y);
bool isTouchCalibrationScreenActive();
void openTouchCalibrationScreen();
void handleTouchCalibrationStep();
bool loadTouchCalibrationFromFile();
bool saveTouchCalibrationToFile();
int priceToChartY(float price, float low, float high, int y, int h);
void canvasSetPixel(int x, int y, uint32_t color);
void canvasFillRect(int x, int y, int w, int h, uint32_t color);
void canvasHLine(int x, int y, int w, uint32_t color);
void canvasVLine(int x, int y, int h, uint32_t color);
void canvasDrawRect(int x, int y, int w, int h, uint32_t color);
void drawBtcDayChart();
void updateWifiState();
void beginWiFi();
bool checkInternetConnectivity();
String extractJsonNumber(const String& payload, const String& key);
String extractJsonString(const String& payload, const String& key);
String weatherStationNameForSource(JsonArrayConst sources, int sourceId);
int weatherCodeFromText(String text);
bool weatherHasRecentPrecipitation(JsonVariantConst weather);
int weatherPriorityCodeFromCondition(String text);
int weatherCodeFromBrightSky(JsonVariantConst weather, const String& iconText, const String& conditionText);
String cryptoProductId();
String cryptoPairTitle();
String cryptoDayTitle();
String cryptoPricePrefixText();
String cryptoSpotUrl();
String cryptoCandlesBaseUrl();
String cryptoOkStatus();
uint32_t cryptoChartGranularitySeconds();
int cryptoChartCandleCount();
const char* cryptoChartTimeframeLabel();
String cryptoChartPriceText(const String& fallbackPrice, float livePrice);
void resetCryptoDataState(const char* statusText);
void configureSecureClient(WiFiClientSecure& client);
void formatQuoteCompact(float value, char* buffer, size_t bufferSize);
void updateBtcDayStatsLocked();
bool parseNextNumber(const String& payload, int& index, double& value);
void sortCandlesAscending(BtcCandle* candles, int count);
int parseCoinbaseCandles(const String& payload, BtcCandle* outCandles, int maxCandles);
static BtcCandle* allocateBtcCandleBuffer(const char* name, bool& inPsram);
bool initBtcStorage();
void storeBtcCandles(const BtcCandle* candles, int count);
void updateLiveCandleFromPrice(float price);
bool fetchWeatherValue();
String buildBrightSkyUrl();
bool fetchBtcPrice();
String readHttpPayloadChunked(HTTPClient& http, size_t reserveBytes);
String buildKlipperQueryUrl();
String urlEncodeQueryParam(const String& text);
String formatKlipperTemperature(const String& currentValue, const String& targetValue);
String formatKlipperProgress(const String& progressValue);
String formatKlipperDuration(const String& secondsValue);
String formatDurationClock(float seconds, bool forceHours);
String formatKlipperDurationProgress(const String& secondsValue, float estimatedSeconds);
String formatKlipperState(String state);
String formatKlippyConnectionState(String state);
String formatKlippyMessageForScreen(String message);
String formatKlipperDisplayMessage(String message);
String klippyOfflineDetail(const String& state, const String& message);
String formatKlipperFile(String filename);
uint32_t parseKlipperColor(String colorText);
String formatKlipperMmuInfo(int tool, int gate, const String& action, const String& operation, const String& filament);
String jsonStringValue(JsonVariantConst value);
String jsonNumberText(JsonVariantConst value);
int jsonIntValue(JsonVariantConst value, int fallback);
bool fetchKlipperFileMetadata(const String& filename, float& estimatedSeconds);
float klipperEstimatedSecondsForFile(const String& filename);
bool fetchKlipperPrinterName();
bool fetchKlipperServerInfo(String& klippyState, String& klippyMessage);
bool fetchKlipperPrinterInfo(String& klippyState, String& klippyMessage);
bool fetchKlipperStatus();
String formatUtcIsoTime(time_t value);
String buildBtcCandlesUrl();
bool fetchBtcCandles();
void fetchDataTask(void *pvParameters);
void initLvglDisplay();

