tome9111991/ESP32-S3_Project/ESP32-8048S043C/KlipperCryptoWeatherPanel/KlipperCryptoWeatherPanel.ino
unsigned long currentScreenInterval() {
  return currentScreen == SCREEN_TIME ? timeScreenInterval : defaultScreenInterval;
}

bool startFetchTask() {
  if (fetchTaskHandle != NULL) {
    return true;
  }

  BaseType_t fetchTaskCreated = pdFAIL;

#ifdef CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
  fetchTaskCreated = xTaskCreatePinnedToCoreWithCaps(
    fetchDataTask,
    "FetchData",
    fetchTaskStackSize,
    NULL,
    fetchTaskPriority,
    &fetchTaskHandle,
    fetchTaskCore,
    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT
  );
  fetchTaskStackInPsram = (fetchTaskCreated == pdPASS);
#endif

  if (fetchTaskCreated != pdPASS) {
    fetchTaskCreated = xTaskCreatePinnedToCore(
      fetchDataTask,
      "FetchData",
      fetchTaskStackSize,
      NULL,
      fetchTaskPriority,
      &fetchTaskHandle,
      fetchTaskCore
    );
    fetchTaskStackInPsram = false;
  }
  if (fetchTaskCreated != pdPASS) {
    Serial.println("FetchData Task Init fehlgeschlagen!");
    fetchTaskHandle = NULL;
    return false;
  }

  Serial.printf(
    "FetchData Task gestartet: Core %d, Prio %u, Stack %s\n",
    (int)fetchTaskCore,
    (unsigned)fetchTaskPriority,
    fetchTaskStackInPsram ? "PSRAM" : "intern"
  );
  return true;
}

void startNetworkServices() {
  wifiSetupActive = false;
  currentScreen = nextScreenState(SCREEN_KLIPPER);
  refreshUi();
  lv_screen_load(screenForState(currentScreen));
  lastScreenSwitch = millis();
  beginWiFi();
  configureTimeOnce();
  startFetchTask();
}

void setup() {
  Serial.begin(115200);
  delay(200);
  printBootDiagnostics();

  dataMutex = xSemaphoreCreateMutex();
  if (dataMutex == NULL) {
    Serial.println("Mutex Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }

  networkMutex = xSemaphoreCreateMutex();
  if (networkMutex == NULL) {
    Serial.println("Network Mutex Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }

  initSettingsStorage();
  loadWifiSettingsFromFile();
  loadTouchCalibrationFromFile();
  loadDisplaySettingsFromFile();
  loadScreenSettingsFromFile();
  loadCryptoSettingsFromFile();

  if (!initBtcStorage()) {
    Serial.println("BTC Speicher Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }

  if (!initBoardDisplay()) {
    Serial.println("ESP32-8048S043C Display Init fehlgeschlagen!");
    while (true) {
      delay(1000);
    }
  }
  setDisplayBrightness(dayBrightness);
  printDisplayDiagnostics();

  initLvglDisplay();
  initTouchInput();
  initLvglTouchInput();
  createUi();
  lv_timer_handler();

  if (wifiCredentialsConfigured()) {
    startNetworkServices();
  } else {
    openWifiSetupScreen("WLAN-Daten eingeben");
  }
}

void loop() {
  bool setupScreenOpen = isSettingsOverlayActive();
  if (!setupScreenOpen) {
    updateWifiState();
  }
  handleTouchInput();
  handleTouchCalibrationStep();

  if (setupScreenOpen) {
    lv_timer_handler();
    delay(5);
    return;
  }

  unsigned long now = millis();
  bool popupMenuOpen = isPopupMenuOpen();
  bool screenRotationPaused = popupMenuOpen || touchPressed;
  if (!popupMenuOpen && now - lastUiRefresh >= uiRefreshInterval) {
    lastUiRefresh = now;
    refreshUi();
  }

  if (now - lastBrightnessRefresh >= brightnessRefreshInterval) {
    lastBrightnessRefresh = now;
    updateBrightnessBySun();
  }

  if (now - lastHealthLog >= healthLogInterval) {
    lastHealthLog = now;
    printRuntimeHealth();
  }

  if (!screenRotationPaused && !isScreenAvailableForRotation(currentScreen)) {
    lastScreenSwitch = now;
    switchScreen(nextScreenState(currentScreen));
  }

  if (!screenRotationPaused && now - lastScreenSwitch > currentScreenInterval()) {
    lastScreenSwitch = now;
    switchScreen(nextScreenState(currentScreen));
  }

  lv_timer_handler();
  if (
    !popupMenuOpen &&
    currentScreen == SCREEN_BTC_DAY &&
    now - lastScreenSwitch >= screenSwitchSettleInterval &&
    now - lastBtcChartDraw >= btcChartDrawInterval
  ) {
    lastBtcChartDraw = now;
    drawBtcDayChart();
  }
  delay(5);
}
